## Data Cleaning Assignment

In [30]:
import pandas as pd
import numpy as np

In [31]:
df=pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                            'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                            'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                            'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [32]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [33]:
df["From_To"]=df["From_To"].astype(str)
type(df["From_To"])

pandas.core.series.Series

In [34]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

### Splitting the From_To column into 2 separate columns

In [35]:
df[["From","To"]]=df.From_To.str.split("_",expand=True)

In [36]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,NaN,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,NaN,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,londOn

### After splitting the column drop the column From_To column

In [37]:
df.drop("From_To",axis=1,inplace=True)

In [38]:
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    LoNDon      paris
1           NaN            []    <Air France> (12)    MAdrid      miLAN
2       10065.0  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3           NaN          [13]       12. Air France  Budapest      PaRis
4       10085.0      [67, 32]          "Swiss Air"  Brussels     londOn

###  Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [39]:
data=df["From"]
s1=[]
for i in data:
    s1.append(i.capitalize())

In [40]:
s1

['London', 'Madrid', 'London', 'Budapest', 'Brussels']

In [41]:
data1=df["To"]
s2=[]
for i in data1:
    s2.append(i.capitalize())

In [42]:
s2

['Paris', 'Milan', 'Stockholm', 'Paris', 'London']

In [43]:
df["New_To"]=pd.DataFrame(s2)

In [44]:
df

,FlightNumber,RecentDelays,Airline,From,To,New_To
0,10045.0,"[23, 47]",KLM(!),LoNDon,paris,Paris
1,NaN,[],<Air France> (12),MAdrid,miLAN,Milan
2,10065.0,"[24, 43, 87]",(British Airways. ),londON,StockhOlm,Stockholm
3,NaN,[13],12. Air France,Budapest,PaRis,Paris
4,10085.0,"[67, 32]","""Swiss Air""",Brussels,londOn,London

In [45]:
df["New_From"]=pd.DataFrame(s1)

In [46]:
df.drop(columns="From",axis=1,inplace=True)

In [47]:
df.drop(columns="To",axis=1,inplace=True)

In [48]:
df

   FlightNumber  RecentDelays              Airline     New_To  New_From
0       10045.0      [23, 47]               KLM(!)      Paris    London
1           NaN            []    <Air France> (12)      Milan    Madrid
2       10065.0  [24, 43, 87]  (British Airways. )  Stockholm    London
3           NaN          [13]       12. Air France      Paris  Budapest
4       10085.0      [67, 32]          "Swiss Air"     London  Brussels

In [49]:
df.rename(columns={'New_To':'To','New_From':'From'},inplace=True)

### The new dataframe after capitalizing and renaming the columns

In [50]:
df

   FlightNumber  RecentDelays              Airline         To      From
0       10045.0      [23, 47]               KLM(!)      Paris    London
1           NaN            []    <Air France> (12)      Milan    Madrid
2       10065.0  [24, 43, 87]  (British Airways. )  Stockholm    London
3           NaN          [13]       12. Air France      Paris  Budapest
4       10085.0      [67, 32]          "Swiss Air"     London  Brussels

### Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [51]:
df["FlightNumber"].isnull().sum()

2

In [52]:
df["FlightNumber"]

0    10045.0
1        NaN
2    10065.0
3        NaN
4    10085.0
Name: FlightNumber, dtype: float64

In [55]:
df["FlightNumber"]=df["FlightNumber"].interpolate().astype(int)

In [56]:
df

   FlightNumber  RecentDelays              Airline         To      From
0         10045      [23, 47]               KLM(!)      Paris    London
1         10055            []    <Air France> (12)      Milan    Madrid
2         10065  [24, 43, 87]  (British Airways. )  Stockholm    London
3         10075          [13]       12. Air France      Paris  Budapest
4         10085      [67, 32]          "Swiss Air"     London  Brussels

###  In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN. Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [58]:
delays=pd.DataFrame(df.RecentDelays.values.tolist())
delays.columns=['Delay_1','Delay_2','Delay_3']

In [60]:
df=pd.concat([df,delays[['Delay_1','Delay_2','Delay_3']]],axis=1)

In [61]:
df

,FlightNumber,RecentDelays,Airline,To,From,Delay_1,Delay_2,Delay_3
0,10045,"[23, 47]",KLM(!),Paris,London,23.0,47.0,NaN
1,10055,[],<Air France> (12),Milan,Madrid,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),Stockholm,London,24.0,43.0,87.0
3,10075,[13],12. Air France,Paris,Budapest,13.0,NaN,NaN
4,10085,"[67, 32]","""Swiss Air""",London,Brussels,67.0,32.0,NaN

In [62]:
df.drop(columns='RecentDelays',axis=0,inplace=True)

In [63]:
df

,FlightNumber,Airline,To,From,Delay_1,Delay_2,Delay_3
0,10045,KLM(!),Paris,London,23.0,47.0,NaN
1,10055,<Air France> (12),Milan,Madrid,NaN,NaN,NaN
2,10065,(British Airways. ),Stockholm,London,24.0,43.0,87.0
3,10075,12. Air France,Paris,Budapest,13.0,NaN,NaN
4,10085,"""Swiss Air""",London,Brussels,67.0,32.0,NaN